**`teams/delius-iaps/iaps_server`** terragrunt plan on `pull_request` event [#142](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.4/1"
        name                  = "delius_iaps_install_base_packages"
      + supported_os_versions = []
        tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.4"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
            "delius_iaps_set_system_locale-version"              = "0.1.0"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
            "image-recipe"                                       = "delius_iaps_server/0.0.22"
            "infrastructure-configuration"                       = "delius_iaps_server/0.0.22"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.4/1"
        name                  = "delius_iaps_install_ndelius_interface"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.3/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-set-system-locale/0.1.0/1"
        name                  = "delius_iaps_set_system_locale"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.23"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this has been deleted
  - resource "aws_imagebuilder_infrastructure_configuration" "this" {
      - arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-22" -> null
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-22"
        name                          = "delius_iaps_server_0_0_22"
        tags                          = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.4"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
            "delius_iaps_set_system_locale-version"              = "0.1.0"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
            "image-recipe"                                       = "delius_iaps_server/0.0.22"
            "infrastructure-configuration"                       = "delius_iaps_server/0.0.22"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.4/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_base_packages
            description: Install base package managers and packages
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.4
          +       default: 0.1.5
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: DeliusIapsInstallBasePackages
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Set-ExecutionPolicy Bypass -Scope Process -Force; [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.ServicePointManager]::SecurityProtocol -bor 3072; iex ((New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1'))
            
                          Write-Host('vcredist packages')
                          # choco install -y vcredist2010 # Commented out - hoping we don't need to explicitly mention this due to dynamic package dependency
                          # choco install -y vcredist2008 # Commented out - hoping we don't need to explicitly mention this due to dynamic package dependency
          +               choco install -y vcredist140
          +               choco install -y vcredist2015
            
                          Write-Host('nginx proxy')
                          choco install -y nginx
            
                          Write-Host('Firefox browser')
                          choco install -y firefox # install latest version
            
                          Write-Host('7Zip archive util')
                          choco install -y 7zip # install latest version
            
                          Write-Host('OpenSSL util')
                          choco install -y openssl # install latest version
          + 
          +               # Move OpenSSL to a location that is in the PATH
          +               move /Y "C:\Program Files\OpenSSL-Win64\bin\openssl.exe" "C:\ProgramData\chocolatey\bin"
        EOT
      ~ date_created          = "2023-03-28T14:42:03.915Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.4/1" -> (known after apply)
        name                  = "delius_iaps_install_base_packages"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
            # (18 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
            # (18 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.4" -> "0.1.5" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.4/1"
        name                  = "delius_iaps_install_ndelius_interface"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.3/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-set-system-locale/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_set_system_locale
            description: Sets locale to values requested by
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
          +       - name: CreateLocaleConfigFile
          +         action: CreateFile
          +         inputs:
          +           - path: C:\Windows\Temp\UKRegion.xml
          +             content: |
          +               <gs:GlobalizationServices xmlns:gs="urn:longhornGlobalizationUnattend">
          +               <gs:UserList>
          +                 <gs:User UserID="Current" CopySettingsToDefaultUserAcct="true" CopySettingsToSystemAcct="true"/>
          +               </gs:UserList>
          +               <gs:UserLocale>
          +                 <gs:Locale Name="en-GB" SetAsCurrent="true" ResetAllSettings="true">
          +               </gs:UserLocale>
          +               <gs:SystemLocale Name="en-GB"/>
          +               <gs:LocationPreferences>
          +                 <gs:GeoID Value="242"/>
          +               </gs:LocationPreferences>
          +               <gs:MUILanguagePreferences>
          +                 <gs:MUILanguage Value="en-GB"/>
          +                 <gs:MUIFallback Value="en-US"/>
          +               </gs:MUILanguagePreferences>
          +               <gs:InputPreferences>
          +                 <!--en-GB-->
          +                 <gs:InputLanguageID Action="add" ID="0809:00000809" Default="true"/>
          +               </gs:InputPreferences>
          +               </gs:GlobalizationServices>
          +             overwrite: false
                  - name: SetGBLocale
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
          -               Set-WinSystemLocale -SystemLocale en-GB
          -               Set-WinHomeLocation -GeoId 242
          -               Set-WinUserLanguageList -LanguageList (New-WinUserLanguageList -Language en-GB) -Force
          +               # Set Locale, language etc.
          +               & $env:SystemRoot\System32\control.exe "intl.cpl,,/f:`"C:\Windows\Temp\UKRegion.xml`""
          + 
          +               # Set languages/culture
          +               Set-Culture en-GB
        EOT
      ~ date_created          = "2023-03-14T14:34:50.401Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-set-system-locale/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_set_system_locale"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.23" -> "delius_iaps_server/0.0.24"
            # (19 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Delius IAPS server"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "delius_iaps_server"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.5"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
          + "delius_iaps_set_system_locale-version"              = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.24"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.24"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all                         = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.5"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
          + "delius_iaps_set_system_locale-version"              = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.24"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.24"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.22" -> (known after apply)
      ~ date_created      = "2023-03-28T14:42:11.247Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.22" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
            # (18 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.4" -> "0.1.5"
          ~ "delius_iaps_set_system_locale-version"              = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.22" -> "delius_iaps_server/0.0.24"
            # (18 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.22" -> "0.0.24" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-set-system-locale/0.1.0/1" -> (known after apply) # forces replacement
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.4/1" -> (known after apply) # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (9 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be created
  + resource "aws_imagebuilder_infrastructure_configuration" "this" {
      + arn                           = (known after apply)
      + date_created                  = (known after apply)
      + date_updated                  = (known after apply)
      + description                   = "Delius IAPS server"
      + id                            = (known after apply)
      + instance_profile_name         = "ImageBuilder"
      + instance_types                = [
          + "t3.medium",
        ]
      + name                          = "delius_iaps_server_0_0_24"
      + resource_tags                 = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.5"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
          + "delius_iaps_set_system_locale-version"              = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.24"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.24"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + security_group_ids            = [
          + "sg-0987edc89553585ad",
        ]
      + subnet_id                     = "subnet-014d083e052388b2a"
      + tags                          = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.5"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
          + "delius_iaps_set_system_locale-version"              = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.24"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.24"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all                      = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
          + "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
          + "delius_iaps_install_base_packages-version"          = "0.1.5"
          + "delius_iaps_install_im_interface-version"           = "0.1.1"
          + "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
          + "delius_iaps_install_oracle_sql_developer-version"   = "0.1.3"
          + "delius_iaps_set_system_locale-version"              = "0.1.1"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.24"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.24"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + terminate_instance_on_failure = true

      + logging {
          + s3_logs {
              + s3_bucket_name = "ec2-image-builder-logs-20211019134837153100000001"
              + s3_key_prefix  = "delius"
            }
        }
    }

Plan: 5 to add, 8 to change, 3 to destroy.

```
